app/controllers/projects/backers_controller.rb

SELECT "backers".* FROM "backers" WHERE "backers"."project_id" = 1 AND "backers"."confirmed" = 't' ORDER BY confirmed_at DESC LIMIT 10 OFFSET 0
---
  def index
    @backers = @project.backers.confirmed.order("confirmed_at DESC").page(params[:page]).per(10)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def load_project
    @project = Project.find params[:project_id]