app/views/projects/_form.html.slim

SELECT "categories".* FROM "categories" ORDER BY name
---
    = form.input :headline, :input_html => { :maxlength => 140 }
    = form.input :category, :collection => Category.all(:order => :name)