app/views/projects/_project_header.html.slim

      p= link_to 'javascript:void(0)' do
        - unless project.user.address_city.blank?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]