app/views/projects/start.html.slim

SELECT "categories".* FROM "categories"
---
              = label_tag 'category', t('.category')
              = select_tag 'category', options_from_collection_for_select(Category.all, "name", "name"), include_blank: true
            .input