app/views/updates/index.html.slim

SELECT COUNT(*) FROM "updates" WHERE "updates"."project_id" = 1
---
.media_content_update
  - if @project.updates.empty?