app/controllers/projects_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
---
  def index
    index! do |format|
      format.html do
        @title = t("site.title")
        collection_projects = Project.recommended_for_home
        unless collection_projects.empty?
          if current_user and current_user.recommended_project
            @recommended_project = current_user.recommended_project
            collection_projects = collection_projects.where("id != #{current_user.recommended_project.id}").where("category_id != #{@recommended_project.category_id}")

INSERT INTO "notifications" ("created_at", "dismissed", "email_subject", "email_text", "facebook_text", "project_id", "text", "twitter_text", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def send_mail
    current_user.update_attributes({ email: params[:contact] }) if current_user.email.nil?
    ProjectsMailer.start_project_email(
      params[:how_much_you_need],
      params[:category],
      params[:about],
      params[:rewards],
      params[:video],
      params[:facebook],
      params[:twitter],
      params[:blog],
      params[:links],
      params[:know_us_via],
      params[:contact],
      current_user,
      "#{I18n.t('site.base_url')}#{user_path(current_user)}").deliver

    # Send project receipt
    notification_text = I18n.t('project.start.notification_text', :locale => current_user.locale)
    email_subject = I18n.t('project.start.email_subject', :locale => current_user.locale)
    email_text = I18n.t('project.start.email_text',
                        :facebook => I18n.t('site.facebook', :locale => current_user.locale),
                        :blog => I18n.t('site.blog', :locale => current_user.locale),
                        :explore_link => explore_url,
                        :email => (I18n.t('site.email.contact', :locale => current_user.locale)),
                        :locale => current_user.locale)
    Notification.create :user => current_user, :text => notification_text, :email_subject => email_subject, :email_text => email_text

INSERT INTO "projects" ("about", "about_html", "can_finish", "category_id", "created_at", "expires_at", "finished", "flickr_image", "flickr_thumb", "flickr_url", "goal", "headline", "home_page_comment", "image_url", "name", "permalink", "photo", "recommended", "rejected", "short_url", "successful", "updated_at", "user_id", "video_url", "visible") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25) RETURNING "id"
UPDATE "projects" SET "user_id" = 4, "permalink" = 'fsdfsdfsdfsdfsdfds', "name" = 'sdfsdfsdfsdf', "video_url" = '', "flickr_url" = '6182502866', "about" = 'Nothing', "headline" = 'fjkdsljfklsdjfsd', "category_id" = 11, "goal" = 3243.0, "expires_at" = '2012-09-30 03:59:59.000000', "about_html" = '<p>Nothing</p>', "created_at" = '2012-09-26 23:21:00.895234', "updated_at" = '2012-09-26 23:21:00.895234', "flickr_image" = 'http://farm7.staticflickr.com/6164/6182502866_02bce5bacd_z.jpg', "flickr_thumb" = 'http://farm7.staticflickr.com/6164/6182502866_02bce5bacd_m.jpg' WHERE "projects"."id" = 17
---
  def create
    params[:project][:expires_at] += (23.hours + 59.minutes + 59.seconds) if params[:project][:expires_at]
    if params[:project][:permalink] == ''
      params[:project][:permalink] = nil
    end
    validate_rewards_attributes if params[:project][:rewards_attributes].present?
    create!(:notice => t('projects.create.success'))
    # When it can't create the project the @project doesn't exist and then it causes a record not found
    # because @project.reload *works only with created records*
    unless @project.new_record?
      @project.reload
      @project.update_attributes({ short_url: bitly })

SELECT "projects".* FROM "projects" WHERE "projects"."permalink" = 'newbeginning' LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "1-a-new-beginning"]]
SELECT "rewards".* FROM "rewards" WHERE "rewards"."project_id" = 1 ORDER BY minimum_value
SELECT "backers".* FROM "backers" WHERE "backers"."project_id" = 1 AND "backers"."confirmed" = 't' ORDER BY confirmed_at DESC LIMIT 12
---
  def show
    begin
      if params[:permalink].present?
        @project = Project.find_by_permalink! params[:permalink]
      elsif resource.permalink
        return redirect_to project_by_slug_path(resource.permalink)
      end

      @project = Project.find params[:id] if params[:id].present?
      if !params[:permalink].present? and @project.permalink.present?
        return redirect_to project_by_slug_url(permalink: @project.permalink)
      end

      show!{
        @title = @project.name
        @rewards = @project.rewards.order(:minimum_value).all
        @backers = @project.backers.confirmed.limit(12).order("confirmed_at DESC").all

SELECT COUNT(*) FROM "projects" WHERE (permalink = 'whata')
---
  def check_slug
    project = Project.where("permalink = ?", params[:permalink])
    render :json => {:available => project.empty?}.to_json

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "1-a-new-beginning"]]
---
  def embed
    @project = Project.find params[:id]

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "1-a-new-beginning"]]
---
  def video_embed
    @project = Project.find params[:id]